console.log('Вёрстка страницы Main соответствует макету при ширине экрана 1280px: +7');
console.log('блок <header>: +1\nблок Not only: +1\nблок About: +1\nблок Our Friends: +1\nблок Help: +1\nблок In addition: +1\nблок <footer>: +1');
console.log('Вёрстка страницы Main соответствует макету при ширине экрана 768px: +7');
console.log('блок <header>: +1\nблок Not only: +1\nблок About: +1\nблок Our Friends: +1\nблок Help: +1\nблок In addition: +1\nблок <footer>: +1');
console.log('Вёрстка страницы Main соответствует макету при ширине экрана 320px: +7');
console.log('блок <header>: +1\nблок Not only: +1\nблок About: +1\nблок Our Friends: +1\nблок Help: +1\nблок In addition: +1\nблок <footer>: +1');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +5');
console.log('блок <header>: +1\nблок Our Friends: +2\nблок <footer>: +2');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +3');
console.log('блок <header>: +1\nблок Our Friends: +1\nблок <footer>: +1');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +3');
console.log('блок <header>: +1\nблок Our Friends: +1\nблок <footer>: +1');
console.log('Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20');
console.log('нет полосы прокрутки при ширине страницы Main от 1280рх до 768рх: +5\nнет полосы прокрутки при ширине страницы Main от 768рх до 320рх: +5\nнет полосы прокрутки при ширине страницы Pets от 1280рх до 768рх: +5\nнет полосы прокрутки при ширине страницы Pets от 768рх до 320рх: +5')
console.log('Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции +8')
console.log('на странице Main: +4\nна странице Pets: +4')
console.log('При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4')
console.log('Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ : +8')
console.log('Итоговый бал [74]')