console.log('Вёрстка +10 реализован интерфейс игры +5 в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5');
console.log('При кликах по игровому полю по очереди отображаются крестики и нолики. Первая фигура всегда крестик +10');
console.log('Игра завершается, когда три фигуры выстроились в ряд по вертикали, горизонтали или диагонали +0');
console.log('По окончанию игры выводится её результат - выигравшая фигура и количество ходов от начала игры до её завершения +0');
console.log('Результаты последних 10 игр сохраняются в local storage. Есть таблица рекордов, в которой отображаются результаты предыдущих 10 игр +0');
console.log('Анимации или звуки, или настройки игры. Баллы начисляются за любой из перечисленных пунктов +0');
console.log('Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10 высокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо')
console.log('Итого баллов [30]')