console.log('Вёрстка +10');
console.log('вёрстка аудиоплеера: есть кнопка Play/Pause, кнопки "Вперёд" и "Назад" для \nпролистывания аудиотреков, прогресс-бар, отображается название и автор трека +5');
console.log('в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5');
console.log('Кнопка Play/Pause +10');
console.log('есть кнопка Play/Pause, при клике по которой можно запустить или остановить проигрывание аудиотрека +5 \nвнешний вид и функционал кнопки Play/Pause изменяется в зависимости от того, проигрывается ли в данный момент аудиотрек +5');
console.log('При кликах по кнопкам "Вперёд" и "Назад" переключается проигрываемый аудиотрек. \nАудиотреки пролистываются по кругу - после последнего идёт первый +10 \nПри смене аудиотрека меняется изображение - обложка аудиотрека +0');
console.log('Прогресс-бар отображает прогресс проигрывания текущего аудиотрека. При перемещении ползунка вручную меняется текущее время проигрывания аудиотрека +5 \nОтображается продолжительность аудиотрека и его текущее время проигрывания +0');
console.log('Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10 \nвысокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо');
console.log('итоговая отметка [45]');